       *> Text styles

       01 T-RESET PIC X(4) VALUE X"1B5B306D".
       01 T-BOLD PIC X(4) VALUE X"1B5B316D".
       01 T-DIM PIC X(4) VALUE X"1B5B326D".
       01 T-ITALIC PIC X(4) VALUE X"1B5B336D".
       01 T-UNDERLINE PIC X(4) VALUE X"1B5B346D".
       01 T-BLINK PIC X(4) VALUE X"1B5B356D".
       01 T-REVERSE PIC X(4) VALUE X"1B5B376D".
       01 T-HIDDEN PIC X(4) VALUE X"1B5B386D".
       01 T-STRIKE PIC X(4) VALUE X"1B5B396D".


       *> Foreground colors

       01 T-BLACK PIC X(5) VALUE X"1B5B33306D".
       01 T-RED PIC X(5) VALUE X"1B5B33316D".
       01 T-GREEN PIC X(5) VALUE X"1B5B33326D".
       01 T-YELLOW PIC X(5) VALUE X"1B5B33336D".
       01 T-BLUE PIC X(5) VALUE X"1B5B33346D".
       01 T-MAGENTA PIC X(5) VALUE X"1B5B33356D".
       01 T-CYAN PIC X(5) VALUE X"1B5B33366D".
       01 T-WHITE PIC X(5) VALUE X"1B5B33376D".


       *> Bright foreground colors

       01 T-BRIGHT-BLACK PIC X(5) VALUE X"1B5B39306D".
       01 T-BRIGHT-RED PIC X(5) VALUE X"1B5B39316D".
       01 T-BRIGHT-GREEN PIC X(5) VALUE X"1B5B39326D".
       01 T-BRIGHT-YELLOW PIC X(5) VALUE X"1B5B39336D".
       01 T-BRIGHT-BLUE PIC X(5) VALUE X"1B5B39346D".
       01 T-BRIGHT-MAGENTA PIC X(5) VALUE X"1B5B39356D".
       01 T-BRIGHT-CYAN PIC X(5) VALUE X"1B5B39366D".
       01 T-BRIGHT-WHITE PIC X(5) VALUE X"1B5B39376D".


       *> Background colors

       01 T-BG-BLACK PIC X(5) VALUE X"1B5B34306D".
       01 T-BG-RED PIC X(5) VALUE X"1B5B34316D".
       01 T-BG-GREEN PIC X(5) VALUE X"1B5B34326D".
       01 T-BG-YELLOW PIC X(5) VALUE X"1B5B34336D".
       01 T-BG-BLUE PIC X(5) VALUE X"1B5B34346D".
       01 T-BG-MAGENTA PIC X(5) VALUE X"1B5B34356D".
       01 T-BG-CYAN PIC X(5) VALUE X"1B5B34366D".
       01 T-BG-WHITE PIC X(5) VALUE X"1B5B34376D".


       *> Screen

       01 T-CLEAR PIC X(4) VALUE X"1B5B324A".
       01 T-HOME PIC X(4) VALUE X"1B5B3348".


       *> Cursor movement

       01 T-CURSOR-UP PIC X(4) VALUE X"1B5B3141".
       01 T-CURSOR-DOWN PIC X(4) VALUE X"1B5B3142".
       01 T-CURSOR-RIGHT PIC X(4) VALUE X"1B5B3143".
       01 T-CURSOR-LEFT PIC X(4) VALUE X"1B5B3144".
       01 T-CURSOR-HIDE PIC X(6) VALUE X"1B5B3F32356C".
       01 T-CURSOR-SHOW PIC X(6) VALUE X"1B5B3F323568".


       *> Erasing

       01 T-ERASE-LINE PIC X(4) VALUE X"1B5B324B".
       01 T-ERASE-SCREEN PIC X(4) VALUE X"1B5B324A".
       